Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions)
Creates a new energy analysis detailed model.
Remarks:
The generated energy model is always returned in world coordinates.
The method TransformModel() transforms all surfaces in the model according to
ground plane, shared coordinates and true north.
document:
The document that contains the physical model of the building.
options:
The options to control the calculation rules.
Returns:
The created model instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Throws if there are no valid spatial bounding elements,
or no valid spatial elements in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the energy analysis detail model.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Throws if user aborted the energy analysis detail model creation.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.Create(Autodesk.Revit.DB.Document)
Creates a new energy analysis detailed model.
Remarks:
The generated energy model is always returned in world coordinates.
The method TransformModel() transforms all surfaces in the model according to
ground plane, shared coordinates and true north.
document:
The document that contains the physical model of the building.
Returns:
The created model instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Throws if there are no valid spatial bounding elements,
or no valid spatial elements in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the energy analysis detail model.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Throws if user aborted the energy analysis detail model creation.
Since:
2012